{"pageProps":{"mdxSource":{"compiledSource":"\"use strict\";\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, [\"components\"]);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"h2\", null, \"The idea\"), mdx(\"p\", null, \"Before I was a software developer I was a scaffolder, for 6 years. It wasn't\\nwhat I wanted to do, I had moved to Sweden in 2010 having gone to university in\\nLondon and met my would be wife. When we arrived I didn't speak the language and\\nmy girlfriend was pregnant with our first child, so as needs must I got a job\\nthrough a contact of my father in law as a scaffolder in Stockholm. We had moved\\nto the north of Sweden so this meant living in Stockholm during the week and\\ntravelling back up north for 7 hours every weekend to see my wife. I did this\\nfor 8 months until I found another scaffolding job in the north where we lived.\"), mdx(\"p\", null, \"The years passed and we had another child, bought a house, got married and had\\nlots of pets. (At one time or another we had a cat, rabbit, tortoise and\\nhamster) This was all great, except something had been missing from my life, I\\nmissed having a creative outlet, something for me to relax with and at the same\\ntime dive into to escape the boredom of my day job. I had been taking night\\nclasses to learn swedish but it was a long slog and progress was thin on the\\nground, which meant that i couldn't really engage in conversations at social\\ngatherings or at work.\"), mdx(\"h2\", null, \"Online\"), mdx(\"p\", null, \"Until one day in 2015 I decided to look into the possibility of selling\\nsomething online. At first I had no idea what I was looking for or how to go\\nabout getting an idea of what to sell let alone how to do it. I had no idea\\nabout creating websites, how to sell things on a website, how to source the\\nthing you want to sell, how to ship it to the customer or even how to get\\ncustomers!\"), mdx(\"p\", null, \"After much googling I happened across\\n\", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://trends.google.com/trends/?geo=US\"\n  }), \"Google Trends\"), \", I used this and a\\ncombination of searching for what was cool at the time that I found out about\\nwooden sunglasses. This idea seemed a bit wild to me. How could sunglasses be\\nmade of wood? How would they be stable? I soon realized that there were indeed a\\nfew companies out there that was not only selling them but making them too. Now\\nI should jump back a few steps here and point out that this didn't happen over\\nnight. I had planned to sell children's clothing, all eco, fair trade etc but\\nthe costs were crazy and we certainly didn't have the money to be throwing into\\nsomething like that, competing with huge companies which had been doing it for\\nyears.\"), mdx(\"p\", null, \"Once I decided upon wooden sunglasses it was time to figure out how to sell\\nthem.\"), mdx(\"p\", null, \"Now before we continue I must say that this isn't going to be a step by step\\nof how to do this stuff, this is merely my experience of going through this\"), mdx(\"p\", null, \"When we look at our clothing, our kids toys, our kitchen utensils or our mobiles\\nthey all, most of the time, have something in common. They are made in China. So\\nit stood to reason that this would be a good place to start. Sourcing items from\\nChina can be done in many different ways, one of those ways is from\\n\", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://www.alibaba.com/\"\n  }), \"Alibaba\"), \", a type of Ebay for wholesale. I searched\\nthrough some companies that made wooden sunglasses and sent them questions\\nasking about price, quantity, shipping etc.. All the things I thought I would\\nneed to know in order to begin selling online. Some responded and some didn't\\nbut I ended up with a shortlist of companies and items that i could begin with.\"), mdx(\"p\", null, \"Now it works like this. They have a catalog of items from which you can order\\nsamples. Samples are expensive (relatively speaking to the final items cost) so\\nyou pick some items you like the look of and order them from the list of\\ncompanies you have gathered. As these items are comping from China they take\\nsome time. So spreading that order is good as it gives you the best chance of\\nfinding the right company with the right product.\"), mdx(\"p\", null, \"Once I got the glasses I needed a website to sell them on. At this point in time\\nI had no idea how to make a website so after some market research landed on\\nShopify as the platform to host my site and sell my items. You know the drill,\\ndrag and drop until you have something that looks ok. We took the pictures\\nourselves (me and my wife). I had looked up how to do product photography at\\nhome, bog white sheets of paper, slight curve at the back, utilize the sunlight\\nfrom the windows by having the table placed next to a window on the side.\"), mdx(\"p\", null, \"I finally had a site up and running, had chosen a supplier, got some stock and\\nwas ready to go! I was going to make millions, it was going to be amazing, easy\\nmoney!\"), mdx(\"p\", null, \"Except it wasn't and I didn't sell anything. This was mainly because no one knew\\nmy site existed. I had only told friends and they were kind enough to buy some\\nglasses but other than that there were no sales. The fact that no one knew my\\nsite existed wasn't the only reason I didn't sell anything however. When looking\\nat some other sites that sold wooden sunglasses I realized that I had been\\ncopying a formula used by someone with big investment and a celebrity\\nendorsement. They had managed to get Kylie Jenner to pose in their glasses\\nbefore she became the breakout, multi-million dollar star she is today. After\\nshe became mega famous their sales went through the roof and they could then\\nafford to by in more product, keep the prices dirt cheap (the mark-up on buying\\nitems from China pre-made is ridiculous) and pay for more marketing.\"), mdx(\"p\", null, \"During this phase, which I like to think of as a trial run, I used to send out\\nthe glasses in cardboard boxes filled with wood chippings. This was a terrible\\nidea. Don't do this! \\uD83D\\uDE06\"), mdx(\"h2\", null, \"Back to the drawing board\"), mdx(\"p\", null, \"So it was back to the drawing board. Buying in pre-made glasses was not what I\\nwanted to do. I wanted to design my own and create a brand around them. Me and\\nmy wife (who is a wonderful illustrator) set to work drawing glasses, in detail\\nto the millimeter. We put together some designs we were happy with and I started\\nthe hunt for a manufacturer which could make them for us. My first port of call\\nwas Europe. Then I branched out to the Americas. Both of these ideas failed\\nrather flat as the cost of having them custom made was far to high for us to\\nhandle, not only that but the only people that made them were selling them\\nthemselves so they were unable to make for us too.\"), mdx(\"p\", null, \"So this led me back to China again, but with a different plan. I wouldn't be\\nusing Alibaba this time, instead I searched for general purpose manufacturers\\nand filtered from there until I found a couple which were willing to make our\\ndesigns a reality. After getting some samples from a few of them I settled on\\none and so we began production on a line of wooden shades!\"), mdx(\"p\", null, \"I stuck with Shopify but paid for a theme that I thought would encapsulate my\\nidea of what the brand would be. Coming up with a name was also quite hard, it\\nwas my mum that actually suggested the one we chose (I shift between I and we a\\nlot here, this I because although this was my endeavor, my wife was also heavily\\ninvolved), SideRoot.\"), mdx(\"p\", null, \"It was a play on words meaning to take a different path to the others, take a\\nside route, with route being swapped out for root, like a tree root. Get it?\\n\\uD83D\\uDE43\"), mdx(\"p\", null, \"We had a friend in Stockholm who knew a professional photographer so We sent\\ndown a batch of the glasses and they had a photo shoot with some models, all for\\nthe price of some of the glasses. Win, win.\"), mdx(\"p\", null, \"I now had a name, products designed by my wife and I and a website with\\nprofessional product and model photos. But I wasn't quite ready to launch, I had\\nlearnt from the previous attempt that you can launch anything you want but if a\\ntree falls in the woods.....\"), mdx(\"p\", null, \"Marketing. Certainly a tough cookie but with some effort, lost dollars, A/B\\ntesting and perseverance a wonderful thing indeed! I created Facebook and\\nInstagram accounts for the company as you need to have a social presence, and\\npoured hours into learning how to do Facebook Ads. I'm not going to lie, it's\\nhard.\"), mdx(\"p\", null, \"After some time and testing we launched again. We got sales. If you have ever\\nhad a Shopify store you will know that they have an app and whenever you get a\\nsale you get to here to most glorious sound in the world, a small \\\"Ching Ching\\\"!\\nIt wasn't long before a local opticians wanted to sell our wooden sunglasses in\\ntheir store. Then a store in central Stockholm got in contact. I had calls from\\nother websites wanted to stock our glasses too, though we only accepted one\\noffer.\"), mdx(\"h2\", null, \"Kickstarter\"), mdx(\"p\", null, \"Things were going well but the big difference in buying in pre-made glasses and\\ndesigning them yourself is the cost. Paying a manufacturer to create custom made\\nglasses costs a lot more and as such our mark-up was much smaller. Even though\\nwe were selling more we couldn't afford to design and pay for our next seasons\\nglasses run. It was then that I decided to try out\\n\", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://www.kickstarter.com/\"\n  }), \"Kickstarter\"), \". I ran a campaign and it basically\\nfailed. I tried again, only this time I concentrated on copy and offers. What\\nwould convince people to get on board? Our story of course! Being honest in\\nanything in life will bring you the best rewards, be that being honest with\\nyourself or your business.\"), mdx(\"p\", null, \"It was a success, The campaign was 249% funded and we had the money needed to\\nlaunch a new season of designs! You can checkout the campaign here:\\n\", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://www.kickstarter.com/projects/sideroot/sideroot-the-first-flexible-wood-sunglasses-a-perf?ref=user_menu\"\n  }), \"SideRoot Kickstarter\"), \".\\nTo re-use that win in our marketing I decided to add all of the people that\\nbought a pair, or more, of our glasses to our website in a dedicated page. This\\nmade them feel special, like they were apart of something, added weight to our\\nclaim of mass sales and enabled me to push this onwards in future marketing\\ncampaigns.\"), mdx(\"p\", null, \"I had another idea that I thought would combine well with our Kickstarter\\nsuccess, and that was to plant trees. I contact a few non-profit organizations\\nand found one i liked, \", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://trees.org/\"\n  }), \"Trees for the Future\"), \". We agreed\\nthat for every pair we sold, they would plant 10 trees which would help to\\nprovide families with a sustainable food source, feed for their livestock and\\nfuel for their fires. This basically completed the brand.\"), mdx(\"p\", null, \"After a while it was becoming apparent that I couldn't sustain this level of\\ntime investment as the business grew so I looked to sell. I wont go into details\\nbut the long and short of it was, I put a price on the company, had some offers,\\nthen someone came and just said name your price. That was that. Soon after I was\\nback to being just a scaffolder without the creative outlet I so desired. It\\njust so happened that my wife saw an add for a C# .NET course starting in our\\ncity. I enrolled in that, got a job as a frontend developer, taught myself\\nJavaScript and React. Fell in love with it and started learning outside of work\\neveryday, pumping those creative juices. The rest as they say is history. \\uD83D\\uDC4A\"), mdx(\"p\", null, \"Oh i should probably mention the website, it's still live, not sure what the new\\nowner is doing with it as nothing seems to have changed since i sold it to him.\\n\", mdx(\"a\", _extends({\n    parentName: \"p\"\n  }, {\n    \"href\": \"https://sideroot.com/\"\n  }), \"SideRoot\")));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">The idea</p><p>Before I was a software developer I was a scaffolder, for 6 years. It wasn&#x27;t\nwhat I wanted to do, I had moved to Sweden in 2010 having gone to university in\nLondon and met my would be wife. When we arrived I didn&#x27;t speak the language and\nmy girlfriend was pregnant with our first child, so as needs must I got a job\nthrough a contact of my father in law as a scaffolder in Stockholm. We had moved\nto the north of Sweden so this meant living in Stockholm during the week and\ntravelling back up north for 7 hours every weekend to see my wife. I did this\nfor 8 months until I found another scaffolding job in the north where we lived.</p><p>The years passed and we had another child, bought a house, got married and had\nlots of pets. (At one time or another we had a cat, rabbit, tortoise and\nhamster) This was all great, except something had been missing from my life, I\nmissed having a creative outlet, something for me to relax with and at the same\ntime dive into to escape the boredom of my day job. I had been taking night\nclasses to learn swedish but it was a long slog and progress was thin on the\nground, which meant that i couldn&#x27;t really engage in conversations at social\ngatherings or at work.</p><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">Online</p><p>Until one day in 2015 I decided to look into the possibility of selling\nsomething online. At first I had no idea what I was looking for or how to go\nabout getting an idea of what to sell let alone how to do it. I had no idea\nabout creating websites, how to sell things on a website, how to source the\nthing you want to sell, how to ship it to the customer or even how to get\ncustomers!</p><p>After much googling I happened across\n<a href=\"https://trends.google.com/trends/?geo=US\">Google Trends</a>, I used this and a\ncombination of searching for what was cool at the time that I found out about\nwooden sunglasses. This idea seemed a bit wild to me. How could sunglasses be\nmade of wood? How would they be stable? I soon realized that there were indeed a\nfew companies out there that was not only selling them but making them too. Now\nI should jump back a few steps here and point out that this didn&#x27;t happen over\nnight. I had planned to sell children&#x27;s clothing, all eco, fair trade etc but\nthe costs were crazy and we certainly didn&#x27;t have the money to be throwing into\nsomething like that, competing with huge companies which had been doing it for\nyears.</p><p>Once I decided upon wooden sunglasses it was time to figure out how to sell\nthem.</p><p>Now before we continue I must say that this isn&#x27;t going to be a step by step\nof how to do this stuff, this is merely my experience of going through this</p><p>When we look at our clothing, our kids toys, our kitchen utensils or our mobiles\nthey all, most of the time, have something in common. They are made in China. So\nit stood to reason that this would be a good place to start. Sourcing items from\nChina can be done in many different ways, one of those ways is from\n<a href=\"https://www.alibaba.com/\">Alibaba</a>, a type of Ebay for wholesale. I searched\nthrough some companies that made wooden sunglasses and sent them questions\nasking about price, quantity, shipping etc.. All the things I thought I would\nneed to know in order to begin selling online. Some responded and some didn&#x27;t\nbut I ended up with a shortlist of companies and items that i could begin with.</p><p>Now it works like this. They have a catalog of items from which you can order\nsamples. Samples are expensive (relatively speaking to the final items cost) so\nyou pick some items you like the look of and order them from the list of\ncompanies you have gathered. As these items are comping from China they take\nsome time. So spreading that order is good as it gives you the best chance of\nfinding the right company with the right product.</p><p>Once I got the glasses I needed a website to sell them on. At this point in time\nI had no idea how to make a website so after some market research landed on\nShopify as the platform to host my site and sell my items. You know the drill,\ndrag and drop until you have something that looks ok. We took the pictures\nourselves (me and my wife). I had looked up how to do product photography at\nhome, bog white sheets of paper, slight curve at the back, utilize the sunlight\nfrom the windows by having the table placed next to a window on the side.</p><p>I finally had a site up and running, had chosen a supplier, got some stock and\nwas ready to go! I was going to make millions, it was going to be amazing, easy\nmoney!</p><p>Except it wasn&#x27;t and I didn&#x27;t sell anything. This was mainly because no one knew\nmy site existed. I had only told friends and they were kind enough to buy some\nglasses but other than that there were no sales. The fact that no one knew my\nsite existed wasn&#x27;t the only reason I didn&#x27;t sell anything however. When looking\nat some other sites that sold wooden sunglasses I realized that I had been\ncopying a formula used by someone with big investment and a celebrity\nendorsement. They had managed to get Kylie Jenner to pose in their glasses\nbefore she became the breakout, multi-million dollar star she is today. After\nshe became mega famous their sales went through the roof and they could then\nafford to by in more product, keep the prices dirt cheap (the mark-up on buying\nitems from China pre-made is ridiculous) and pay for more marketing.</p><p>During this phase, which I like to think of as a trial run, I used to send out\nthe glasses in cardboard boxes filled with wood chippings. This was a terrible\nidea. Don&#x27;t do this! 😆</p><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">Back to the drawing board</p><p>So it was back to the drawing board. Buying in pre-made glasses was not what I\nwanted to do. I wanted to design my own and create a brand around them. Me and\nmy wife (who is a wonderful illustrator) set to work drawing glasses, in detail\nto the millimeter. We put together some designs we were happy with and I started\nthe hunt for a manufacturer which could make them for us. My first port of call\nwas Europe. Then I branched out to the Americas. Both of these ideas failed\nrather flat as the cost of having them custom made was far to high for us to\nhandle, not only that but the only people that made them were selling them\nthemselves so they were unable to make for us too.</p><p>So this led me back to China again, but with a different plan. I wouldn&#x27;t be\nusing Alibaba this time, instead I searched for general purpose manufacturers\nand filtered from there until I found a couple which were willing to make our\ndesigns a reality. After getting some samples from a few of them I settled on\none and so we began production on a line of wooden shades!</p><p>I stuck with Shopify but paid for a theme that I thought would encapsulate my\nidea of what the brand would be. Coming up with a name was also quite hard, it\nwas my mum that actually suggested the one we chose (I shift between I and we a\nlot here, this I because although this was my endeavor, my wife was also heavily\ninvolved), SideRoot.</p><p>It was a play on words meaning to take a different path to the others, take a\nside route, with route being swapped out for root, like a tree root. Get it?\n🙃</p><p>We had a friend in Stockholm who knew a professional photographer so We sent\ndown a batch of the glasses and they had a photo shoot with some models, all for\nthe price of some of the glasses. Win, win.</p><p>I now had a name, products designed by my wife and I and a website with\nprofessional product and model photos. But I wasn&#x27;t quite ready to launch, I had\nlearnt from the previous attempt that you can launch anything you want but if a\ntree falls in the woods.....</p><p>Marketing. Certainly a tough cookie but with some effort, lost dollars, A/B\ntesting and perseverance a wonderful thing indeed! I created Facebook and\nInstagram accounts for the company as you need to have a social presence, and\npoured hours into learning how to do Facebook Ads. I&#x27;m not going to lie, it&#x27;s\nhard.</p><p>After some time and testing we launched again. We got sales. If you have ever\nhad a Shopify store you will know that they have an app and whenever you get a\nsale you get to here to most glorious sound in the world, a small &quot;Ching Ching&quot;!\nIt wasn&#x27;t long before a local opticians wanted to sell our wooden sunglasses in\ntheir store. Then a store in central Stockholm got in contact. I had calls from\nother websites wanted to stock our glasses too, though we only accepted one\noffer.</p><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">Kickstarter</p><p>Things were going well but the big difference in buying in pre-made glasses and\ndesigning them yourself is the cost. Paying a manufacturer to create custom made\nglasses costs a lot more and as such our mark-up was much smaller. Even though\nwe were selling more we couldn&#x27;t afford to design and pay for our next seasons\nglasses run. It was then that I decided to try out\n<a href=\"https://www.kickstarter.com/\">Kickstarter</a>. I ran a campaign and it basically\nfailed. I tried again, only this time I concentrated on copy and offers. What\nwould convince people to get on board? Our story of course! Being honest in\nanything in life will bring you the best rewards, be that being honest with\nyourself or your business.</p><p>It was a success, The campaign was 249% funded and we had the money needed to\nlaunch a new season of designs! You can checkout the campaign here:\n<a href=\"https://www.kickstarter.com/projects/sideroot/sideroot-the-first-flexible-wood-sunglasses-a-perf?ref=user_menu\">SideRoot Kickstarter</a>.\nTo re-use that win in our marketing I decided to add all of the people that\nbought a pair, or more, of our glasses to our website in a dedicated page. This\nmade them feel special, like they were apart of something, added weight to our\nclaim of mass sales and enabled me to push this onwards in future marketing\ncampaigns.</p><p>I had another idea that I thought would combine well with our Kickstarter\nsuccess, and that was to plant trees. I contact a few non-profit organizations\nand found one i liked, <a href=\"https://trees.org/\">Trees for the Future</a>. We agreed\nthat for every pair we sold, they would plant 10 trees which would help to\nprovide families with a sustainable food source, feed for their livestock and\nfuel for their fires. This basically completed the brand.</p><p>After a while it was becoming apparent that I couldn&#x27;t sustain this level of\ntime investment as the business grew so I looked to sell. I wont go into details\nbut the long and short of it was, I put a price on the company, had some offers,\nthen someone came and just said name your price. That was that. Soon after I was\nback to being just a scaffolder without the creative outlet I so desired. It\njust so happened that my wife saw an add for a C# .NET course starting in our\ncity. I enrolled in that, got a job as a frontend developer, taught myself\nJavaScript and React. Fell in love with it and started learning outside of work\neveryday, pumping those creative juices. The rest as they say is history. 👊</p><p>Oh i should probably mention the website, it&#x27;s still live, not sure what the new\nowner is doing with it as nothing seems to have changed since i sold it to him.\n<a href=\"https://sideroot.com/\">SideRoot</a></p>","scope":{"title":"How I created a company then sold it","published":true,"category":"Whatever","author":"Richard Haines","tags":["entrepreneur","start a business"],"pin":false,"description":"I once started a company, grew it then sold it","growth":"full"}},"frontMatter":{"title":"How I created a company then sold it","published":true,"category":"Whatever","author":"Richard Haines","tags":["entrepreneur","start a business"],"pin":false,"description":"I once started a company, grew it then sold it","growth":"full"},"slug":["how-i-created-a-company-then-sold-it"]},"__N_SSG":true}