{"pageProps":{"mdxSource":{"compiledSource":"\"use strict\";\n\nfunction _extends() { _extends = Object.assign || function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\n\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\n/* @jsx mdx */\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\n\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n      props = _objectWithoutProperties(_ref, [\"components\"]);\n\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"p\", null, \"A couple of weeks ago I had an idea, I'd been in the process of updating my profile picture across my different social\\nmedia platforms, as well as correcting some bio info. During the undertaking of laborious task I thought to myself\"), mdx(\"blockquote\", null, mdx(\"p\", {\n    parentName: \"blockquote\"\n  }, \"Why can't I just do this all from one place? Why do I have to faff about with different sites?\")), mdx(\"h2\", null, \"The gist of it\"), mdx(\"p\", null, \"I decided to create an app, well a Gatsby site but I'll call it an app, which would house a hub from where I could\\nupdate all my social media profile info from the one place. This idea then grew into handling profile pictures and cover\\nimages so the management of media would also have to have its own space in the hub. I then broke it down and decided\\nthat in fact, I could flesh this out into a sort of dev hub, and to that end I did what any sane developer would do when\\nthey have an idea but haven't started coding it yet....I brought a domain! \", mdx(ExternalLink, {\n    href: \"https://www.devpack.dev/\",\n    mdxType: \"ExternalLink\"\n  }, \"devpack.dev\")), mdx(\"p\", null, \"As well as editing and controlling a profile from one place and managing images I decided that being able to manage\\ndomains from this same hub would also be a handy addition. This would be taken care of via the \", mdx(ExternalLink, {\n    href: \"https://www.namecheap.com/support/api/intro/\",\n    mdxType: \"ExternalLink\"\n  }, \"namecheap API\"), \" with the idea being to be able to buy sell and manage (to a certain degree) any domains through namecheap. Which incidently I switched to from GoDaddy a couple fo years ago and have never looked back!\"), mdx(\"h2\", null, \"Some sugar\"), mdx(\"p\", null, \"Not content with setting myself a mountain to climb with my initial goals I decided to add one other thing into the mix. A couple of months ago I created a Gatsby theme for creating a resume (\", mdx(ExternalLink, {\n    href: \"https://www.npmjs.com/package/gatsby-theme-dev-resume\",\n    mdxType: \"ExternalLink\"\n  }, \"gatsby-theme-dev-resume\"), \") Although very happy with the ease with which one could now spin up a new resume with my theme, I was still left wanting on the customization aspects of it in terms of layout and extra content. I thought it would be cool to have a set of pre made components for each section and seb section of a resume and then have a kind of drag and drop UI for putting it all together. The content would be filled in, in the sections themselves. So think lots a nice looking forms really that you can drag about.\"), mdx(\"p\", null, \"The last thing I wanted to add, and this was just on a whim for wanting to actually code the thing! A personal meeting room. Much like Zoom, you have a meeting room that is hosted inside our dev pack where you can invite people to hang out or have meetings from. Unlike Zoom however this would not be evasive in terms of privacy. This was to be handled via the \", mdx(ExternalLink, {\n    href: \"https://docs.daily.co/docs\",\n    mdxType: \"ExternalLink\"\n  }, \"daily.co API\"), \", Ive already spun up a test version in a Gatsby site and its super cool with a very wide range of things you can add or just not add and have a simple video call setup.\"), mdx(\"h2\", null, \"What now\"), mdx(\"p\", null, \"All this being said I might retract the resume and meeting rooms features as I near release, depending on the work load but also if i still see value in actually offering them as a service in the dev pack. Would people use these features?\"), mdx(\"p\", null, \"So far I have:\"), mdx(\"ul\", null, mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Landing page with newsletter form\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"Private routes setup which are auth handled via onegraph\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"The hub structure setup\"), mdx(\"li\", {\n    parentName: \"ul\"\n  }, \"The dev card base layout setup as well as being able to edit the Github profile of the logged in user. Im working on Twitter\")), mdx(\"p\", null, \"In my next post I will start going through how I am making this, starting with the dev card. Hope some will find this of interest, you can signup for updates via the form on \", mdx(ExternalLink, {\n    href: \"https://www.devpack.dev/\",\n    mdxType: \"ExternalLink\"\n  }, \"devpack.dev\"), \".\"));\n}\n\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<p>A couple of weeks ago I had an idea, I&#x27;d been in the process of updating my profile picture across my different social\nmedia platforms, as well as correcting some bio info. During the undertaking of laborious task I thought to myself</p><blockquote><p>Why can&#x27;t I just do this all from one place? Why do I have to faff about with different sites?</p></blockquote><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">The gist of it</p><p>I decided to create an app, well a Gatsby site but I&#x27;ll call it an app, which would house a hub from where I could\nupdate all my social media profile info from the one place. This idea then grew into handling profile pictures and cover\nimages so the management of media would also have to have its own space in the hub. I then broke it down and decided\nthat in fact, I could flesh this out into a sort of dev hub, and to that end I did what any sane developer would do when\nthey have an idea but haven&#x27;t started coding it yet....I brought a domain! <div href=\"https://www.devpack.dev/\">devpack.dev</div></p><p>As well as editing and controlling a profile from one place and managing images I decided that being able to manage\ndomains from this same hub would also be a handy addition. This would be taken care of via the <div href=\"https://www.namecheap.com/support/api/intro/\">namecheap API</div> with the idea being to be able to buy sell and manage (to a certain degree) any domains through namecheap. Which incidently I switched to from GoDaddy a couple fo years ago and have never looked back!</p><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">Some sugar</p><p>Not content with setting myself a mountain to climb with my initial goals I decided to add one other thing into the mix. A couple of months ago I created a Gatsby theme for creating a resume (<div href=\"https://www.npmjs.com/package/gatsby-theme-dev-resume\">gatsby-theme-dev-resume</div>) Although very happy with the ease with which one could now spin up a new resume with my theme, I was still left wanting on the customization aspects of it in terms of layout and extra content. I thought it would be cool to have a set of pre made components for each section and seb section of a resume and then have a kind of drag and drop UI for putting it all together. The content would be filled in, in the sections themselves. So think lots a nice looking forms really that you can drag about.</p><p>The last thing I wanted to add, and this was just on a whim for wanting to actually code the thing! A personal meeting room. Much like Zoom, you have a meeting room that is hosted inside our dev pack where you can invite people to hang out or have meetings from. Unlike Zoom however this would not be evasive in terms of privacy. This was to be handled via the <div href=\"https://docs.daily.co/docs\">daily.co API</div>, Ive already spun up a test version in a Gatsby site and its super cool with a very wide range of things you can add or just not add and have a simple video call setup.</p><style data-emotion-css=\"15salui\">.css-15salui{font-size:1xl;font-family:heading;margin-top:3px;margin-bottom:3px;}</style><p class=\"chakra-text css-15salui\">What now</p><p>All this being said I might retract the resume and meeting rooms features as I near release, depending on the work load but also if i still see value in actually offering them as a service in the dev pack. Would people use these features?</p><p>So far I have:</p><style data-emotion-css=\"2yqebn\">.css-2yqebn{list-style-type:bullet;margin-left:1em;margin-top:2px;margin-bottom:2px;}</style><ul role=\"list\" class=\"css-2yqebn\"><li class=\"css-0\">Landing page with newsletter form</li><li class=\"css-0\">Private routes setup which are auth handled via onegraph</li><li class=\"css-0\">The hub structure setup</li><li class=\"css-0\">The dev card base layout setup as well as being able to edit the Github profile of the logged in user. Im working on Twitter</li></ul><p>In my next post I will start going through how I am making this, starting with the dev card. Hope some will find this of interest, you can signup for updates via the form on <div href=\"https://www.devpack.dev/\">devpack.dev</div>.</p>","scope":{"title":"Side project distractions","published":true,"category":"Whatever","author":"Richard Haines","tags":["devpack","side projects"],"pin":false,"description":"A new side project idea","growth":"full"}},"frontMatter":{"title":"Side project distractions","published":true,"category":"Whatever","author":"Richard Haines","tags":["devpack","side projects"],"pin":false,"description":"A new side project idea","growth":"full"},"slug":["side-project-distractions"]},"__N_SSG":true}